tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
tap "scalacenter/bloop"
cask "adoptopenjdk"
brew "ack"
brew "autoconf"
brew "automake"
brew "avro-tools"
brew "cloog", link: false
brew "cmake"
brew "coreutils"
brew "fish"
brew "fzf"
brew "gcc"
brew "git"
brew "gnu-getopt"
brew "gnu-sed"
brew "libgpg-error"
brew "gnupg"
brew "gource"
brew "htop"
brew "hub"
brew "libtool"
brew "imagemagick"
brew "oniguruma"
brew "jq"
brew "kubernetes-cli", link: false
brew "libiconv"
brew "macvim"
brew "maven"
brew "minikube"
brew "node", link: false
brew "parquet-tools"
brew "tree"
brew "pass"
brew "pwgen"
brew "q"
brew "ruby-build"
brew "rbenv"
brew "reattach-to-user-namespace"
brew "sbt"
brew "scala"
brew "telnet"
brew "tmux"
brew "wget"
cask "google-chrome"
cask "iterm2"
cask "rambox"
cask "spectacle"
